'''
출처 : https://programmers.co.kr/learn/courses/30/lessons/62049

문제 설명
직사각형 종이를 n번 접으려고 합니다. 이때, 
항상 오른쪽 절반을 왼쪽으로 접어 나갑니다. 

위 그림에서 ∨ 모양이 생긴 부분은 점선(0)으로, 
∧ 모양이 생긴 부분은 실선(1)으로 표시했습니다.

종이를 접은 횟수 n이 매개변수로 주어질 때,
 종이를 절반씩 n번 접은 후 모두 펼쳤을 때 생기는 
 접힌 부분의 모양을 배열에 담아 return 하도록 solution 함수를 완성해주세요.

제한사항

종이를 접는 횟수 n은 1 이상 20 이하의 자연수입니다.
종이를 접었다 편 후 생긴 굴곡이 ∨ 모양이면 0, ∧ 모양이면 1로 나타냅니다.
가장 왼쪽의 굴곡 모양부터 순서대로 배열에 담아 return 해주세요.

입출력 예
n	result
1	[0]                           
2	[0,0,1]                         2
3	[0,0,1,0,0,1,1]                 5
4   [0,0,1,0,0,1,1,0,0,0,1,1,0,1,1] 11

입출력 예 설명
입출력 예 #1
종이의 오른쪽 절반을 왼쪽으로 한번 접었다 펴면 아래 그림과 같이 굴곡이 생깁니다.

image

따라서 [0]을 return 하면 됩니다.

입출력 예 #2
문제의 예시와 같습니다.

입출력 예 #3
종이를 절반씩 세 번 접은 후 다시 펼치면 아래 그림과 같이 굴곡이 생깁니다.

image

따라서 [0,0,1,0,0,1,1]을 return 하면 됩니다.

'''


# 내가 생각한 풀이법
# 접는건 중앙의 기준으로 접는다 중앙은 항상 0
# 좌측변 + 0 + 좌측변 중간값을 1로 바꿈

def solution(n):
    answer = [0]
    for i in range(1,n):
        p=len(answer)
        answer = answer+[0]+answer
        answer[p+1+int(p/2)]=1
    return answer

print(solution(20))